# AssetPropertyList Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssetPropertyList Methods
AssetPropertyList Class See Also
---
The AssetPropertyList type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddConnectedAsset | Adds a new connected asset attached to this asset property, if it allows it.  (Inherited from AssetProperty.) |
| AddCopyAsConnectedAsset | Makes a copy of the asset and connects it to this property.  (Inherited from AssetProperty.) |
| AddNewAssetAsColor | Adds a new AssetPropertyDouble4 property to the list containing a value matching the input color. |
| AddNewAssetPropertyDouble | Adds a new AssetPropertyDouble containing the input value to this list. |
| AddNewAssetPropertyInteger | Adds a new AssetPropertyInteger containing the input value to this list. |
| Dispose | (Inherited from AssetProperty.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetAllConnectedProperties | Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime.  (Inherited from AssetProperty.) |
| GetConnectedProperty | Gets one connected property with specified index.  (Inherited from AssetProperty.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetSingleConnectedAsset | Gets the single connected asset attached to this asset property, if it exists.  (Inherited from AssetProperty.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetValue | Gets a collection of properties stored in this property list. These properties are copied. |
| InsertNewAssetAsColor | Insert a new AssetPropertyDouble4 containing the input value to this list. |
| InsertNewAssetPropertyDouble | Inserts a new AssetPropertyDouble containing the input value to this list. |
| InsertNewAssetPropertyInteger | Insert a new AssetPropertyInteger containing the input value to this list. |
| IsEditable | Check if property can be edited.  (Inherited from AssetProperty.) |
| IsValidSchemaIdentifier | Check that schema name is valid  (Inherited from AssetProperty.) |
| IsValidValue | Check that value is valid. |
| RemoveAssetProperty | Remove the AssetProperty from the list. |
| RemoveConnectedAsset | Removes the connected asset attached to this asset property if any.  (Inherited from AssetProperty.) |
| SetValue | Sets collection of properties stored in this property list. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace